{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "digit", 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "digit_reshape", 
      "attrs": {"shape": "(64, 10, 1, 1)"}, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "digit_broadcast", 
      "attrs": {"shape": "(64, 10, 28, 28)"}, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "dflat_concat", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[0, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "d1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "d1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dbn1_gamma", 
      "attrs": {
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dbn1_beta", 
      "attrs": {
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dbn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dbn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "dbn1", 
      "attrs": {
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0], [9, 0, 1], [10, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "dact1", 
      "attrs": {
        "act_type": "elu", 
        "slope": "0.25"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "d2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "d2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dbn2_gamma", 
      "attrs": {
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dbn2_beta", 
      "attrs": {
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dbn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dbn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "dbn2", 
      "attrs": {
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 1], [19, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "dact2", 
      "attrs": {
        "act_type": "elu", 
        "slope": "0.25"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "d3_weight", 
      "attrs": {
        "kernel": "(4, 4)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "d3", 
      "attrs": {
        "kernel": "(4, 4)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dbn4_gamma", 
      "attrs": {
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dbn4_beta", 
      "attrs": {
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dbn4_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dbn4_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "dbn4", 
      "attrs": {
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 1], [27, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "dact4", 
      "attrs": {
        "act_type": "elu", 
        "slope": "0.25"
      }, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "dflat", 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dfc_weight", 
      "attrs": {
        "no_bias": "0", 
        "num_hidden": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dfc_bias", 
      "attrs": {
        "no_bias": "0", 
        "num_hidden": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "dfc", 
      "attrs": {
        "no_bias": "0", 
        "num_hidden": "1"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "LogisticRegressionOutput", 
      "name": "D_sym", 
      "inputs": [[33, 0, 0], [34, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    5, 
    7, 
    8, 
    9, 
    10, 
    14, 
    16, 
    17, 
    18, 
    19, 
    22, 
    24, 
    25, 
    26, 
    27, 
    31, 
    32, 
    34
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42
  ], 
  "heads": [[35, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10301]}
}