{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "normal", 
      "name": "gen_rand", 
      "attr": {
        "loc": "0", 
        "scale": "1", 
        "shape": "(64, 96, 1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Concat", 
      "name": "gen_concat", 
      "attr": {"num_args": "2"}, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "g1_weight", 
      "attr": {
        "kernel": "(4, 4)", 
        "no_bias": "1", 
        "num_filter": "384"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "g1", 
      "attr": {
        "kernel": "(4, 4)", 
        "no_bias": "1", 
        "num_filter": "384"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gbn1_gamma", 
      "attr": {
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn1_beta", 
      "attr": {
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "gbn1", 
      "attr": {
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 1], [8, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "gact1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "g2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "192", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "g2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "192", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gbn2_gamma", 
      "attr": {
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn2_beta", 
      "attr": {
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "gbn2", 
      "attr": {
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "gact2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "g3_weight", 
      "attr": {
        "kernel": "(4, 4)", 
        "no_bias": "1", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "g3", 
      "attr": {
        "kernel": "(4, 4)", 
        "no_bias": "1", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gbn3_gamma", 
      "attr": {
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn3_beta", 
      "attr": {
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn3_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gbn3_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "gbn3", 
      "attr": {
        "eps": "1e-005", 
        "fix_gamma": "1"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0], [23, 0, 1], [24, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "gact3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "g5_weight", 
      "attr": {
        "kernel": "(4, 4)", 
        "no_bias": "1", 
        "num_filter": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "g5", 
      "attr": {
        "kernel": "(4, 4)", 
        "no_bias": "1", 
        "num_filter": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gact5", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[28, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    3, 
    5, 
    6, 
    7, 
    8, 
    11, 
    13, 
    14, 
    15, 
    16, 
    19, 
    21, 
    22, 
    23, 
    24, 
    27
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    32, 
    33, 
    34, 
    35, 
    36
  ], 
  "heads": [[29, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 905]}
}